{
  "_name_or_path": "distilbert-base-multilingual-cased",
  "activation": "gelu",
  "architectures": [
    "DistilBertForSequenceClassification"
  ],
  "attention_dropout": 0.1,
  "dim": 768,
  "dropout": 0.1,
  "hidden_dim": 3072,
  "id2label": {
    "0": "route_request",
    "1": "flight_info",
    "2": "crowd_query",
    "3": "loyalty_query",
    "4": "general_info",
    "5": "unknown"
  },
  "initializer_range": 0.02,
  "label2id": {
    "crowd_query": 2,
    "flight_info": 1,
    "general_info": 4,
    "loyalty_query": 3,
    "route_request": 0,
    "unknown": 5
  },
  "max_position_embeddings": 512,
  "model_type": "distilbert",
  "n_heads": 12,
  "n_layers": 6,
  "output_past": true,
  "pad_token_id": 0,
  "problem_type": "single_label_classification",
  "qa_dropout": 0.1,
  "seq_classif_dropout": 0.2,
  "sinusoidal_pos_embds": false,
  "tie_weights_": true,
  "torch_dtype": "float32",
  "transformers_version": "4.40.0",
  "vocab_size": 119547
}
